import unittest
from wikiedits.hindi_sentence_tokenizer import HindiSentenceTokenizer


class HindiSentenceTokenizerTest(unittest.TestCase):

    def setUp(self):

        self.tokenizer=HindiSentenceTokenizer()

    def test_tokenize_simple(self):
        text = """कालिंजर दुर्ग, भारतीय राज्य उत्तर प्रदेश के बांदा जिला स्थित एक दुर्ग है। बुन्देलखण्ड क्षेत्र में विंध्य पर्वत पर स्थित यह दुर्ग विश्व धरोहर स्थल खजुराहो से ९७.७ किमी दूर है। इसे भारत के सबसे विशाल और अपराजेय दुर्गों में गिना जाता रहा है। इस दुर्ग में कई प्राचीन मन्दिर हैं। इनमें कई मंदिर तीसरी से पाँचवीं सदी गुप्तकाल के हैं। यहाँ के शिव मन्दिर के बारे में मान्यता है कि सागर-मन्थन से निकले कालकूट विष को पीने के बाद भगवान शिव ने यही तपस्या कर उसकी ज्वाला शांत की थी। """
        sent=["कालिंजर दुर्ग, भारतीय राज्य उत्तर प्रदेश के बांदा जिला स्थित एक दुर्ग है।",
         "बुन्देलखण्ड क्षेत्र में विंध्य पर्वत पर स्थित यह दुर्ग विश्व धरोहर स्थल खजुराहो से ९७.७ किमी दूर है। इसे भारत के सबसे विशाल और अपराजेय दुर्गों में गिना जाता रहा है।",
         "इसे भारत के सबसे विशाल और अपराजेय दुर्गों में गिना जाता रहा है। इस दुर्ग में कई प्राचीन मन्दिर हैं। इनमें कई मंदिर तीसरी से पाँचवीं सदी गुप्तकाल के हैं। यहाँ के शिव मन्दिर के बारे में मान्यता है कि सागर-मन्थन से निकले कालकूट विष को पीने के बाद भगवान शिव ने यही तपस्या कर उसकी ज्वाला शांत की थी।"
         ]        
        self.assertListEqual(list(self.tokenizer.tokenize(text)),sent)

    def test_tokenize_empty(self):
        text ="   "
        sent=[]
        self.assertListEqual(list(self.tokenizer.tokenize(text)),sent)

    def test_tokenize_other(self):
        text ="कालिंजर दुर्ग, भारतीय राज्य उत्तर प्रदेश के बांदा! विंध्य पर्वत पर स्थित यह दुर्ग विश्व धरोहर!? विंध्य पर्वत पर स्थित यह दुर्ग विश्व धरोहर"
        sent=["कालिंजर दुर्ग, भारतीय राज्य उत्तर प्रदेश के बांदा!",
              "विंध्य पर्वत पर स्थित यह दुर्ग विश्व धरोहर!?",
              "विंध्य पर्वत पर स्थित यह दुर्ग विश्व धरोहर"]
        self.assertListEqual(list(self.tokenizer.tokenize(text)),sent)
